"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/Descompactar para a pasta actual";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/Descompactar para a Secretária";

"The Unarchiver/Unarchive To..." = "The Unarchiver/Descompactar para...";
